{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "data_input", "config": {"name": "data_input", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 3, 565, 565]}}, {"class_name": "Conv2D", "inbound_nodes": [[["data_input", 0, 0, {}]]], "name": "conv1_1", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv1_1", "padding": "same", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv1_1", 0, 0, {}]]], "name": "conv1_2", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv1_2", "padding": "same", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv1_2", 0, 0, {}]]], "name": "max_pool1", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_first", "name": "max_pool1", "padding": "same"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pool1", 0, 0, {}]]], "name": "conv2_1", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2_1", "padding": "same", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_1", 0, 0, {}]]], "name": "conv2_2", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2_2", "padding": "same", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2_2", 0, 0, {}]]], "name": "max_pool2", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_first", "name": "max_pool2", "padding": "same"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pool2", 0, 0, {}]]], "name": "conv3_1", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv3_1", "padding": "same", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_1", 0, 0, {}]]], "name": "conv3_2", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv3_2", "padding": "same", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_2", 0, 0, {}]]], "name": "conv3_3", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv3_3", "padding": "same", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv3_3", 0, 0, {}]]], "name": "max_pool3", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_first", "name": "max_pool3", "padding": "same"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pool3", 0, 0, {}]]], "name": "conv4_1", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv4_1", "padding": "same", "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv4_1", 0, 0, {}]]], "name": "conv4_2", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv4_2", "padding": "same", "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv4_2", 0, 0, {}]]], "name": "conv4_3", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv4_3", "padding": "same", "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv2_2", 0, 0, {}]]], "name": "conv2_2_16", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2_2_16", "padding": "same", "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv3_3", 0, 0, {}]]], "name": "conv3_3_16", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv3_3_16", "padding": "same", "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv4_3", 0, 0, {}]]], "name": "conv4_3_16", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv4_3_16", "padding": "same", "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["conv2_2_16", 0, 0, {}]]], "name": "side_multi2_up", "config": {"trainable": true, "data_format": "channels_first", "name": "side_multi2_up", "size": [2, 2]}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["conv3_3_16", 0, 0, {}]]], "name": "side_multi3_up", "config": {"trainable": true, "data_format": "channels_first", "name": "side_multi3_up", "size": [4, 4]}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["conv4_3_16", 0, 0, {}]]], "name": "side_multi4_up", "config": {"trainable": true, "data_format": "channels_first", "name": "side_multi4_up", "size": [8, 8]}}, {"class_name": "Conv2D", "inbound_nodes": [[["conv1_2", 0, 0, {}]]], "name": "conv1_2_16", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "linear", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv1_2_16", "padding": "same", "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Cropping2D", "inbound_nodes": [[["side_multi2_up", 0, 0, {}]]], "name": "upside_multi2", "config": {"trainable": true, "data_format": "channels_first", "name": "upside_multi2", "cropping": [[0, 1], [0, 1]]}}, {"class_name": "Cropping2D", "inbound_nodes": [[["side_multi3_up", 0, 0, {}]]], "name": "upside_multi3", "config": {"trainable": true, "data_format": "channels_first", "name": "upside_multi3", "cropping": [[1, 2], [1, 2]]}}, {"class_name": "Cropping2D", "inbound_nodes": [[["side_multi4_up", 0, 0, {}]]], "name": "upside_multi4", "config": {"trainable": true, "data_format": "channels_first", "name": "upside_multi4", "cropping": [[1, 2], [1, 2]]}}, {"class_name": "Concatenate", "inbound_nodes": [[["conv1_2_16", 0, 0, {}], ["upside_multi2", 0, 0, {}], ["upside_multi3", 0, 0, {}], ["upside_multi4", 0, 0, {}]]], "name": "concat-upscore", "config": {"trainable": true, "axis": 1, "name": "concat-upscore"}}, {"class_name": "Conv2D", "inbound_nodes": [[["concat-upscore", 0, 0, {}]]], "name": "upscore_fuse", "config": {"kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "activation": "sigmoid", "trainable": true, "kernel_size": [1, 1], "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "name": "upscore_fuse", "padding": "valid", "filters": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "model_1", "output_layers": [["upscore_fuse", 0, 0]], "input_layers": [["data_input", 0, 0]]}, "backend": "tensorflow"}