{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.4", "config": {"input_layers": [["data_input", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "data_input", "config": {"batch_input_shape": [null, 3, 565, 565], "name": "data_input", "dtype": "float32", "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["data_input", 0, 0, {}]]], "name": "conv1_1", "config": {"filters": 64, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv1_1", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first"}}, {"class_name": "Dropout", "inbound_nodes": [[["conv1_1", 0, 0, {}]]], "name": "Drop1_1", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "Drop1_1", "seed": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["Drop1_1", 0, 0, {}]]], "name": "conv1_2", "config": {"filters": 64, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv1_2", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first"}}, {"class_name": "Dropout", "inbound_nodes": [[["conv1_2", 0, 0, {}]]], "name": "Drop1_2", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "Drop1_2", "seed": null}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["Drop1_2", 0, 0, {}]]], "name": "max_pool1", "config": {"strides": [2, 2], "name": "max_pool1", "data_format": "channels_first", "trainable": true, "padding": "same", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pool1", 0, 0, {}]]], "name": "conv2_1", "config": {"filters": 128, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2_1", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first"}}, {"class_name": "Dropout", "inbound_nodes": [[["conv2_1", 0, 0, {}]]], "name": "Drop2_1", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "Drop2_1", "seed": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["Drop2_1", 0, 0, {}]]], "name": "conv2_2", "config": {"filters": 128, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2_2", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first"}}, {"class_name": "Dropout", "inbound_nodes": [[["conv2_2", 0, 0, {}]]], "name": "Drop2_2", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "Drop2_2", "seed": null}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["Drop2_2", 0, 0, {}]]], "name": "max_pool2", "config": {"strides": [2, 2], "name": "max_pool2", "data_format": "channels_first", "trainable": true, "padding": "same", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pool2", 0, 0, {}]]], "name": "conv3_1", "config": {"filters": 256, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv3_1", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first"}}, {"class_name": "Dropout", "inbound_nodes": [[["conv3_1", 0, 0, {}]]], "name": "Drop3_1", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "Drop3_1", "seed": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["Drop3_1", 0, 0, {}]]], "name": "conv3_2", "config": {"filters": 256, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv3_2", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first"}}, {"class_name": "Dropout", "inbound_nodes": [[["conv3_2", 0, 0, {}]]], "name": "Drop3_2", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "Drop3_2", "seed": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["Drop3_2", 0, 0, {}]]], "name": "conv3_3", "config": {"filters": 256, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv3_3", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first"}}, {"class_name": "Dropout", "inbound_nodes": [[["conv3_3", 0, 0, {}]]], "name": "Drop3_3", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "Drop3_3", "seed": null}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["Drop3_3", 0, 0, {}]]], "name": "max_pool3", "config": {"strides": [2, 2], "name": "max_pool3", "data_format": "channels_first", "trainable": true, "padding": "same", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pool3", 0, 0, {}]]], "name": "conv4_1", "config": {"filters": 512, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv4_1", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first"}}, {"class_name": "Dropout", "inbound_nodes": [[["conv4_1", 0, 0, {}]]], "name": "Drop4_1", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "Drop4_1", "seed": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["Drop4_1", 0, 0, {}]]], "name": "conv4_2", "config": {"filters": 512, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv4_2", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first"}}, {"class_name": "Dropout", "inbound_nodes": [[["conv4_2", 0, 0, {}]]], "name": "Drop4_2", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "Drop4_2", "seed": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["Drop4_2", 0, 0, {}]]], "name": "conv4_3", "config": {"filters": 512, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv4_3", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first"}}, {"class_name": "Dropout", "inbound_nodes": [[["conv4_3", 0, 0, {}]]], "name": "Drop4_3", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "Drop4_3", "seed": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["Drop2_2", 0, 0, {}]]], "name": "conv2_2_16", "config": {"filters": 16, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2_2_16", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first"}}, {"class_name": "Conv2D", "inbound_nodes": [[["Drop3_3", 0, 0, {}]]], "name": "conv3_3_16", "config": {"filters": 16, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv3_3_16", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first"}}, {"class_name": "Conv2D", "inbound_nodes": [[["Drop4_3", 0, 0, {}]]], "name": "conv4_3_16", "config": {"filters": 16, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv4_3_16", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first"}}, {"class_name": "Dropout", "inbound_nodes": [[["conv2_2_16", 0, 0, {}]]], "name": "Drop2_2_16", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "Drop2_2_16", "seed": null}}, {"class_name": "Dropout", "inbound_nodes": [[["conv3_3_16", 0, 0, {}]]], "name": "Drop3_3_16", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "Drop3_3_16", "seed": null}}, {"class_name": "Dropout", "inbound_nodes": [[["conv4_3_16", 0, 0, {}]]], "name": "Drop4_3_16", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "Drop4_3_16", "seed": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["Drop1_2", 0, 0, {}]]], "name": "conv1_2_16", "config": {"filters": 16, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv1_2_16", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "trainable": true, "kernel_size": [3, 3], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "data_format": "channels_first"}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["Drop2_2_16", 0, 0, {}]]], "name": "side_multi2_up", "config": {"size": [2, 2], "trainable": true, "name": "side_multi2_up", "data_format": "channels_first"}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["Drop3_3_16", 0, 0, {}]]], "name": "side_multi3_up", "config": {"size": [4, 4], "trainable": true, "name": "side_multi3_up", "data_format": "channels_first"}}, {"class_name": "UpSampling2D", "inbound_nodes": [[["Drop4_3_16", 0, 0, {}]]], "name": "side_multi4_up", "config": {"size": [8, 8], "trainable": true, "name": "side_multi4_up", "data_format": "channels_first"}}, {"class_name": "Dropout", "inbound_nodes": [[["conv1_2_16", 0, 0, {}]]], "name": "Drop1_2_16", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "Drop1_2_16", "seed": null}}, {"class_name": "Cropping2D", "inbound_nodes": [[["side_multi2_up", 0, 0, {}]]], "name": "upside_multi2", "config": {"trainable": true, "cropping": [[0, 1], [0, 1]], "name": "upside_multi2", "data_format": "channels_first"}}, {"class_name": "Cropping2D", "inbound_nodes": [[["side_multi3_up", 0, 0, {}]]], "name": "upside_multi3", "config": {"trainable": true, "cropping": [[1, 2], [1, 2]], "name": "upside_multi3", "data_format": "channels_first"}}, {"class_name": "Cropping2D", "inbound_nodes": [[["side_multi4_up", 0, 0, {}]]], "name": "upside_multi4", "config": {"trainable": true, "cropping": [[1, 2], [1, 2]], "name": "upside_multi4", "data_format": "channels_first"}}, {"class_name": "Concatenate", "inbound_nodes": [[["Drop1_2_16", 0, 0, {}], ["upside_multi2", 0, 0, {}], ["upside_multi3", 0, 0, {}], ["upside_multi4", 0, 0, {}]]], "name": "concat-upscore", "config": {"axis": 1, "name": "concat-upscore", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["concat-upscore", 0, 0, {}]]], "name": "upscore_fuse", "config": {"filters": 4, "kernel_regularizer": null, "kernel_constraint": null, "name": "upscore_fuse", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "trainable": true, "kernel_size": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_first"}}, {"class_name": "Dropout", "inbound_nodes": [[["upscore_fuse", 0, 0, {}]]], "name": "Dropout_Classifier", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "name": "Dropout_Classifier", "seed": null}}], "output_layers": [["Dropout_Classifier", 0, 0]], "name": "model_1"}}