{"class_name": "Model", "backend": "tensorflow", "config": {"output_layers": [["Dropout_Classifier", 0, 0]], "name": "model_1", "input_layers": [["data_input", 0, 0]], "layers": [{"name": "data_input", "config": {"name": "data_input", "dtype": "float32", "batch_input_shape": [null, 3, 565, 565], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv1_1", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv1_1", "activation": "relu", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["data_input", 0, 0, {}]]]}, {"name": "Drop1_1", "config": {"noise_shape": null, "seed": null, "name": "Drop1_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv1_1", 0, 0, {}]]]}, {"name": "conv1_2", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv1_2", "activation": "relu", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop1_1", 0, 0, {}]]]}, {"name": "Drop1_2", "config": {"noise_shape": null, "seed": null, "name": "Drop1_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv1_2", 0, 0, {}]]]}, {"name": "max_pool1", "config": {"name": "max_pool1", "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "trainable": true, "padding": "same"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["Drop1_2", 0, 0, {}]]]}, {"name": "conv2_1", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv2_1", "activation": "relu", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pool1", 0, 0, {}]]]}, {"name": "Drop2_1", "config": {"noise_shape": null, "seed": null, "name": "Drop2_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv2_1", 0, 0, {}]]]}, {"name": "conv2_2", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv2_2", "activation": "relu", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop2_1", 0, 0, {}]]]}, {"name": "Drop2_2", "config": {"noise_shape": null, "seed": null, "name": "Drop2_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv2_2", 0, 0, {}]]]}, {"name": "max_pool2", "config": {"name": "max_pool2", "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "trainable": true, "padding": "same"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["Drop2_2", 0, 0, {}]]]}, {"name": "conv3_1", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv3_1", "activation": "relu", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pool2", 0, 0, {}]]]}, {"name": "Drop3_1", "config": {"noise_shape": null, "seed": null, "name": "Drop3_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv3_1", 0, 0, {}]]]}, {"name": "conv3_2", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv3_2", "activation": "relu", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop3_1", 0, 0, {}]]]}, {"name": "Drop3_2", "config": {"noise_shape": null, "seed": null, "name": "Drop3_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv3_2", 0, 0, {}]]]}, {"name": "conv3_3", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv3_3", "activation": "relu", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop3_2", 0, 0, {}]]]}, {"name": "conv5_1", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv5_1", "activation": "relu", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pool1", 0, 0, {}]]]}, {"name": "Drop3_3", "config": {"noise_shape": null, "seed": null, "name": "Drop3_3", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv3_3", 0, 0, {}]]]}, {"name": "Drop5_1", "config": {"noise_shape": null, "seed": null, "name": "Drop5_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv5_1", 0, 0, {}]]]}, {"name": "max_pool3", "config": {"name": "max_pool3", "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "trainable": true, "padding": "same"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["Drop3_3", 0, 0, {}]]]}, {"name": "conv5_2", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv5_2", "activation": "relu", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop5_1", 0, 0, {}]]]}, {"name": "conv4_1", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv4_1", "activation": "relu", "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pool3", 0, 0, {}]]]}, {"name": "Drop5_2", "config": {"noise_shape": null, "seed": null, "name": "Drop5_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv5_2", 0, 0, {}]]]}, {"name": "Drop4_1", "config": {"noise_shape": null, "seed": null, "name": "Drop4_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv4_1", 0, 0, {}]]]}, {"name": "max_pool4", "config": {"name": "max_pool4", "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "trainable": true, "padding": "same"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["Drop5_2", 0, 0, {}]]]}, {"name": "conv4_2", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv4_2", "activation": "relu", "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop4_1", 0, 0, {}]]]}, {"name": "conv6_1", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv6_1", "activation": "relu", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pool4", 0, 0, {}]]]}, {"name": "Drop4_2", "config": {"noise_shape": null, "seed": null, "name": "Drop4_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv4_2", 0, 0, {}]]]}, {"name": "Drop6_1", "config": {"noise_shape": null, "seed": null, "name": "Drop6_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv6_1", 0, 0, {}]]]}, {"name": "conv4_3", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv4_3", "activation": "relu", "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop4_2", 0, 0, {}]]]}, {"name": "conv6_2", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv6_2", "activation": "relu", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop6_1", 0, 0, {}]]]}, {"name": "Drop4_3", "config": {"noise_shape": null, "seed": null, "name": "Drop4_3", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv4_3", 0, 0, {}]]]}, {"name": "Drop6_2", "config": {"noise_shape": null, "seed": null, "name": "Drop6_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv6_2", 0, 0, {}]]]}, {"name": "conv2_2_16", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv2_2_16", "activation": "linear", "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop2_2", 0, 0, {}]]]}, {"name": "conv3_3_16", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv3_3_16", "activation": "linear", "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop3_3", 0, 0, {}]]]}, {"name": "conv4_3_16", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv4_3_16", "activation": "linear", "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop4_3", 0, 0, {}]]]}, {"name": "conv5_2_16", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv5_2_16", "activation": "linear", "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop5_2", 0, 0, {}]]]}, {"name": "conv6_2_16", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv6_2_16", "activation": "linear", "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop6_2", 0, 0, {}]]]}, {"name": "Drop2_2_16", "config": {"noise_shape": null, "seed": null, "name": "Drop2_2_16", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv2_2_16", 0, 0, {}]]]}, {"name": "Drop3_3_16", "config": {"noise_shape": null, "seed": null, "name": "Drop3_3_16", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv3_3_16", 0, 0, {}]]]}, {"name": "Drop4_3_16", "config": {"noise_shape": null, "seed": null, "name": "Drop4_3_16", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv4_3_16", 0, 0, {}]]]}, {"name": "Drop5_2_16", "config": {"noise_shape": null, "seed": null, "name": "Drop5_2_16", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv5_2_16", 0, 0, {}]]]}, {"name": "Drop6_2_16", "config": {"noise_shape": null, "seed": null, "name": "Drop6_2_16", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv6_2_16", 0, 0, {}]]]}, {"name": "conv1_2_16", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "same", "name": "conv1_2_16", "activation": "linear", "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop1_2", 0, 0, {}]]]}, {"name": "side_multi2_up", "config": {"size": [2, 2], "name": "side_multi2_up", "trainable": true, "data_format": "channels_first"}, "class_name": "UpSampling2D", "inbound_nodes": [[["Drop2_2_16", 0, 0, {}]]]}, {"name": "side_multi3_up", "config": {"size": [4, 4], "name": "side_multi3_up", "trainable": true, "data_format": "channels_first"}, "class_name": "UpSampling2D", "inbound_nodes": [[["Drop3_3_16", 0, 0, {}]]]}, {"name": "side_multi4_up", "config": {"size": [8, 8], "name": "side_multi4_up", "trainable": true, "data_format": "channels_first"}, "class_name": "UpSampling2D", "inbound_nodes": [[["Drop4_3_16", 0, 0, {}]]]}, {"name": "side_multi5_up", "config": {"size": [2, 2], "name": "side_multi5_up", "trainable": true, "data_format": "channels_first"}, "class_name": "UpSampling2D", "inbound_nodes": [[["Drop5_2_16", 0, 0, {}]]]}, {"name": "side_multi6_up", "config": {"size": [4, 4], "name": "side_multi6_up", "trainable": true, "data_format": "channels_first"}, "class_name": "UpSampling2D", "inbound_nodes": [[["Drop6_2_16", 0, 0, {}]]]}, {"name": "Drop1_2_16", "config": {"noise_shape": null, "seed": null, "name": "Drop1_2_16", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["conv1_2_16", 0, 0, {}]]]}, {"name": "upside_multi2", "config": {"data_format": "channels_first", "name": "upside_multi2", "trainable": true, "cropping": [[0, 1], [0, 1]]}, "class_name": "Cropping2D", "inbound_nodes": [[["side_multi2_up", 0, 0, {}]]]}, {"name": "upside_multi3", "config": {"data_format": "channels_first", "name": "upside_multi3", "trainable": true, "cropping": [[1, 2], [1, 2]]}, "class_name": "Cropping2D", "inbound_nodes": [[["side_multi3_up", 0, 0, {}]]]}, {"name": "upside_multi4", "config": {"data_format": "channels_first", "name": "upside_multi4", "trainable": true, "cropping": [[1, 2], [1, 2]]}, "class_name": "Cropping2D", "inbound_nodes": [[["side_multi4_up", 0, 0, {}]]]}, {"name": "upside_multi5", "config": {"data_format": "channels_first", "name": "upside_multi5", "trainable": true, "cropping": [[0, 1], [0, 1]]}, "class_name": "Cropping2D", "inbound_nodes": [[["side_multi5_up", 0, 0, {}]]]}, {"name": "upside_multi6", "config": {"data_format": "channels_first", "name": "upside_multi6", "trainable": true, "cropping": [[1, 2], [1, 2]]}, "class_name": "Cropping2D", "inbound_nodes": [[["side_multi6_up", 0, 0, {}]]]}, {"name": "concat-upscore", "config": {"name": "concat-upscore", "trainable": true, "axis": 1}, "class_name": "Concatenate", "inbound_nodes": [[["Drop1_2_16", 0, 0, {}], ["upside_multi2", 0, 0, {}], ["upside_multi3", 0, 0, {}], ["upside_multi4", 0, 0, {}], ["upside_multi5", 0, 0, {}], ["upside_multi6", 0, 0, {}]]]}, {"name": "upscore_fuse", "config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true, "bias_regularizer": null, "padding": "valid", "name": "upscore_fuse", "activation": "linear", "filters": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["concat-upscore", 0, 0, {}]]]}, {"name": "Dropout_Classifier", "config": {"noise_shape": null, "seed": null, "name": "Dropout_Classifier", "trainable": true, "rate": 0.2}, "class_name": "Dropout", "inbound_nodes": [[["upscore_fuse", 0, 0, {}]]]}]}, "keras_version": "2.1.4"}
