{"backend": "tensorflow", "keras_version": "2.1.5", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["data_input", 0, 0]], "output_layers": [["activation_1", 0, 0]], "layers": [{"name": "data_input", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 565, 565], "dtype": "float32", "sparse": false, "name": "data_input"}}, {"name": "conv1_1", "inbound_nodes": [[["data_input", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 64, "name": "conv1_1", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null}}, {"name": "Drop1_1", "inbound_nodes": [[["conv1_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop1_1", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "conv1_2", "inbound_nodes": [[["Drop1_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 64, "name": "conv1_2", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null}}, {"name": "Drop1_2", "inbound_nodes": [[["conv1_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop1_2", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "max_pool1", "inbound_nodes": [[["Drop1_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pool1", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_first", "padding": "same"}}, {"name": "conv2_1", "inbound_nodes": [[["max_pool1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 128, "name": "conv2_1", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null}}, {"name": "Drop2_1", "inbound_nodes": [[["conv2_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop2_1", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "conv2_2", "inbound_nodes": [[["Drop2_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 128, "name": "conv2_2", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null}}, {"name": "Drop2_2", "inbound_nodes": [[["conv2_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop2_2", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "conv1_1_dev", "inbound_nodes": [[["data_input", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 64, "name": "conv1_1_dev", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [5, 5], "activity_regularizer": null, "bias_constraint": null}}, {"name": "max_pool2", "inbound_nodes": [[["Drop2_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pool2", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_first", "padding": "same"}}, {"name": "Drop1_1_dev", "inbound_nodes": [[["conv1_1_dev", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop1_1_dev", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "conv3_1", "inbound_nodes": [[["max_pool2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 256, "name": "conv3_1", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null}}, {"name": "Drop3_1", "inbound_nodes": [[["conv3_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop3_1", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "conv1_2_dev", "inbound_nodes": [[["Drop1_1_dev", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 64, "name": "conv1_2_dev", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [5, 5], "activity_regularizer": null, "bias_constraint": null}}, {"name": "conv3_2", "inbound_nodes": [[["Drop3_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 256, "name": "conv3_2", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null}}, {"name": "Drop1_2_dev", "inbound_nodes": [[["conv1_2_dev", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop1_2_dev", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "Drop3_2", "inbound_nodes": [[["conv3_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop3_2", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "max_pool1_dev", "inbound_nodes": [[["Drop1_2_dev", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pool1_dev", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_first", "padding": "same"}}, {"name": "conv3_3", "inbound_nodes": [[["Drop3_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 256, "name": "conv3_3", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null}}, {"name": "conv5_1", "inbound_nodes": [[["max_pool1_dev", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 64, "name": "conv5_1", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [5, 5], "activity_regularizer": null, "bias_constraint": null}}, {"name": "Drop3_3", "inbound_nodes": [[["conv3_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop3_3", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "Drop5_1", "inbound_nodes": [[["conv5_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop5_1", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "max_pool3", "inbound_nodes": [[["Drop3_3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pool3", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_first", "padding": "same"}}, {"name": "conv5_2", "inbound_nodes": [[["Drop5_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 64, "name": "conv5_2", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [5, 5], "activity_regularizer": null, "bias_constraint": null}}, {"name": "conv4_1", "inbound_nodes": [[["max_pool3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 512, "name": "conv4_1", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null}}, {"name": "Drop5_2", "inbound_nodes": [[["conv5_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop5_2", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "Drop4_1", "inbound_nodes": [[["conv4_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop4_1", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "max_pool4", "inbound_nodes": [[["Drop5_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pool4", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_first", "padding": "same"}}, {"name": "conv4_2", "inbound_nodes": [[["Drop4_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 512, "name": "conv4_2", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null}}, {"name": "conv6_1", "inbound_nodes": [[["max_pool4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 128, "name": "conv6_1", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [5, 5], "activity_regularizer": null, "bias_constraint": null}}, {"name": "Drop4_2", "inbound_nodes": [[["conv4_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop4_2", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "Drop6_1", "inbound_nodes": [[["conv6_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop6_1", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "conv4_3", "inbound_nodes": [[["Drop4_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 512, "name": "conv4_3", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null}}, {"name": "conv6_2", "inbound_nodes": [[["Drop6_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 128, "name": "conv6_2", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [5, 5], "activity_regularizer": null, "bias_constraint": null}}, {"name": "Drop4_3", "inbound_nodes": [[["conv4_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop4_3", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "Drop6_2", "inbound_nodes": [[["conv6_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop6_2", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "conv2_2_16", "inbound_nodes": [[["Drop2_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 16, "name": "conv2_2_16", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null}}, {"name": "conv3_3_16", "inbound_nodes": [[["Drop3_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 16, "name": "conv3_3_16", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null}}, {"name": "conv4_3_16", "inbound_nodes": [[["Drop4_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 16, "name": "conv4_3_16", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null}}, {"name": "conv5_2_16", "inbound_nodes": [[["Drop5_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 16, "name": "conv5_2_16", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [5, 5], "activity_regularizer": null, "bias_constraint": null}}, {"name": "conv6_2_16", "inbound_nodes": [[["Drop6_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 16, "name": "conv6_2_16", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [5, 5], "activity_regularizer": null, "bias_constraint": null}}, {"name": "Drop2_2_16", "inbound_nodes": [[["conv2_2_16", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop2_2_16", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "Drop3_3_16", "inbound_nodes": [[["conv3_3_16", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop3_3_16", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "Drop4_3_16", "inbound_nodes": [[["conv4_3_16", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop4_3_16", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "Drop5_2_16", "inbound_nodes": [[["conv5_2_16", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop5_2_16", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "Drop6_2_16", "inbound_nodes": [[["conv6_2_16", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop6_2_16", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "conv1_2_16", "inbound_nodes": [[["Drop1_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 16, "name": "conv1_2_16", "use_bias": true, "kernel_regularizer": null, "padding": "same", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null}}, {"name": "side_multi2_up", "inbound_nodes": [[["Drop2_2_16", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "name": "side_multi2_up", "data_format": "channels_first"}}, {"name": "side_multi3_up", "inbound_nodes": [[["Drop3_3_16", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "size": [4, 4], "name": "side_multi3_up", "data_format": "channels_first"}}, {"name": "side_multi4_up", "inbound_nodes": [[["Drop4_3_16", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "size": [8, 8], "name": "side_multi4_up", "data_format": "channels_first"}}, {"name": "side_multi5_up", "inbound_nodes": [[["Drop5_2_16", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "name": "side_multi5_up", "data_format": "channels_first"}}, {"name": "side_multi6_up", "inbound_nodes": [[["Drop6_2_16", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"trainable": true, "size": [4, 4], "name": "side_multi6_up", "data_format": "channels_first"}}, {"name": "Drop1_2_16", "inbound_nodes": [[["conv1_2_16", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Drop1_2_16", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "upside_multi2", "inbound_nodes": [[["side_multi2_up", 0, 0, {}]]], "class_name": "Cropping2D", "config": {"name": "upside_multi2", "trainable": true, "data_format": "channels_first", "cropping": [[0, 1], [0, 1]]}}, {"name": "upside_multi3", "inbound_nodes": [[["side_multi3_up", 0, 0, {}]]], "class_name": "Cropping2D", "config": {"name": "upside_multi3", "trainable": true, "data_format": "channels_first", "cropping": [[1, 2], [1, 2]]}}, {"name": "upside_multi4", "inbound_nodes": [[["side_multi4_up", 0, 0, {}]]], "class_name": "Cropping2D", "config": {"name": "upside_multi4", "trainable": true, "data_format": "channels_first", "cropping": [[1, 2], [1, 2]]}}, {"name": "upside_multi5", "inbound_nodes": [[["side_multi5_up", 0, 0, {}]]], "class_name": "Cropping2D", "config": {"name": "upside_multi5", "trainable": true, "data_format": "channels_first", "cropping": [[0, 1], [0, 1]]}}, {"name": "upside_multi6", "inbound_nodes": [[["side_multi6_up", 0, 0, {}]]], "class_name": "Cropping2D", "config": {"name": "upside_multi6", "trainable": true, "data_format": "channels_first", "cropping": [[1, 2], [1, 2]]}}, {"name": "concat-upscore", "inbound_nodes": [[["Drop1_2_16", 0, 0, {}], ["Drop1_1_dev", 0, 0, {}], ["upside_multi2", 0, 0, {}], ["upside_multi3", 0, 0, {}], ["upside_multi4", 0, 0, {}], ["upside_multi5", 0, 0, {}], ["upside_multi6", 0, 0, {}]]], "class_name": "Concatenate", "config": {"axis": 1, "trainable": true, "name": "concat-upscore"}}, {"name": "upscore_fuse", "inbound_nodes": [[["concat-upscore", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "strides": [1, 1], "data_format": "channels_first", "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "filters": 4, "name": "upscore_fuse", "use_bias": true, "kernel_regularizer": null, "padding": "valid", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null}}, {"name": "Dropout_Classifier", "inbound_nodes": [[["upscore_fuse", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "Dropout_Classifier", "rate": 0.2, "seed": null, "noise_shape": null}}, {"name": "activation_1", "inbound_nodes": [[["Dropout_Classifier", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}}]}}

