{"class_name": "Model", "config": {"input_layers": [["data_input", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "data_input", "config": {"dtype": "float32", "batch_input_shape": [null, 3, 565, 565], "name": "data_input", "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv1_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv1_1", "filters": 64, "data_format": "channels_first", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["data_input", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop1_1", "config": {"rate": 0.2, "trainable": true, "name": "Drop1_1", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv1_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv1_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv1_2", "filters": 64, "data_format": "channels_first", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["Drop1_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop1_2", "config": {"rate": 0.2, "trainable": true, "name": "Drop1_2", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv1_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pool1", "config": {"name": "max_pool1", "data_format": "channels_first", "padding": "same", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "inbound_nodes": [[["Drop1_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2_1", "filters": 128, "data_format": "channels_first", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["max_pool1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop2_1", "config": {"rate": 0.2, "trainable": true, "name": "Drop2_1", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2_2", "filters": 128, "data_format": "channels_first", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["Drop2_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop2_2", "config": {"rate": 0.2, "trainable": true, "name": "Drop2_2", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pool2", "config": {"name": "max_pool2", "data_format": "channels_first", "padding": "same", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "inbound_nodes": [[["Drop2_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv3_1", "filters": 256, "data_format": "channels_first", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["max_pool2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop3_1", "config": {"rate": 0.2, "trainable": true, "name": "Drop3_1", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv3_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv3_2", "filters": 256, "data_format": "channels_first", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["Drop3_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop3_2", "config": {"rate": 0.2, "trainable": true, "name": "Drop3_2", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv3_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv3_3", "filters": 256, "data_format": "channels_first", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["Drop3_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv5_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv5_1", "filters": 64, "data_format": "channels_first", "kernel_size": [5, 5], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["max_pool1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop3_3", "config": {"rate": 0.2, "trainable": true, "name": "Drop3_3", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv3_3", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop5_1", "config": {"rate": 0.2, "trainable": true, "name": "Drop5_1", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv5_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pool3", "config": {"name": "max_pool3", "data_format": "channels_first", "padding": "same", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "inbound_nodes": [[["Drop3_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv5_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv5_2", "filters": 64, "data_format": "channels_first", "kernel_size": [5, 5], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["Drop5_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv4_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv4_1", "filters": 512, "data_format": "channels_first", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["max_pool3", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop5_2", "config": {"rate": 0.2, "trainable": true, "name": "Drop5_2", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv5_2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop4_1", "config": {"rate": 0.2, "trainable": true, "name": "Drop4_1", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv4_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pool4", "config": {"name": "max_pool4", "data_format": "channels_first", "padding": "same", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "inbound_nodes": [[["Drop5_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv4_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv4_2", "filters": 512, "data_format": "channels_first", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["Drop4_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv6_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv6_1", "filters": 128, "data_format": "channels_first", "kernel_size": [5, 5], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["max_pool4", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop4_2", "config": {"rate": 0.2, "trainable": true, "name": "Drop4_2", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv4_2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop6_1", "config": {"rate": 0.2, "trainable": true, "name": "Drop6_1", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv6_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv4_3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv4_3", "filters": 512, "data_format": "channels_first", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["Drop4_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv6_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv6_2", "filters": 128, "data_format": "channels_first", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["Drop6_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop4_3", "config": {"rate": 0.2, "trainable": true, "name": "Drop4_3", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv4_3", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop6_2", "config": {"rate": 0.2, "trainable": true, "name": "Drop6_2", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv6_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2_2_16", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2_2_16", "filters": 16, "data_format": "channels_first", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["Drop2_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_3_16", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "name": "conv3_3_16", "filters": 16, "data_format": "channels_first", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["Drop3_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv4_3_16", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "name": "conv4_3_16", "filters": 16, "data_format": "channels_first", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["Drop4_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv5_2_16", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "name": "conv5_2_16", "filters": 16, "data_format": "channels_first", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["Drop5_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv6_2_16", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "name": "conv6_2_16", "filters": 16, "data_format": "channels_first", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["Drop6_2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop2_2_16", "config": {"rate": 0.2, "trainable": true, "name": "Drop2_2_16", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2_2_16", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop3_3_16", "config": {"rate": 0.2, "trainable": true, "name": "Drop3_3_16", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv3_3_16", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop4_3_16", "config": {"rate": 0.2, "trainable": true, "name": "Drop4_3_16", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv4_3_16", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop5_2_16", "config": {"rate": 0.2, "trainable": true, "name": "Drop5_2_16", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv5_2_16", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop6_2_16", "config": {"rate": 0.2, "trainable": true, "name": "Drop6_2_16", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv6_2_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv1_2_16", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "same", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "name": "conv1_2_16", "filters": 16, "data_format": "channels_first", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["Drop1_2", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "side_multi2_up", "config": {"trainable": true, "name": "side_multi2_up", "data_format": "channels_first", "size": [2, 2]}, "inbound_nodes": [[["Drop2_2_16", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "side_multi3_up", "config": {"trainable": true, "name": "side_multi3_up", "data_format": "channels_first", "size": [4, 4]}, "inbound_nodes": [[["Drop3_3_16", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "side_multi4_up", "config": {"trainable": true, "name": "side_multi4_up", "data_format": "channels_first", "size": [8, 8]}, "inbound_nodes": [[["Drop4_3_16", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "side_multi5_up", "config": {"trainable": true, "name": "side_multi5_up", "data_format": "channels_first", "size": [2, 2]}, "inbound_nodes": [[["Drop5_2_16", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "side_multi6_up", "config": {"trainable": true, "name": "side_multi6_up", "data_format": "channels_first", "size": [4, 4]}, "inbound_nodes": [[["Drop6_2_16", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Drop1_2_16", "config": {"rate": 0.2, "trainable": true, "name": "Drop1_2_16", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv1_2_16", 0, 0, {}]]]}, {"class_name": "Cropping2D", "name": "upside_multi2", "config": {"cropping": [[0, 1], [0, 1]], "name": "upside_multi2", "trainable": true, "data_format": "channels_first"}, "inbound_nodes": [[["side_multi2_up", 0, 0, {}]]]}, {"class_name": "Cropping2D", "name": "upside_multi3", "config": {"cropping": [[1, 2], [1, 2]], "name": "upside_multi3", "trainable": true, "data_format": "channels_first"}, "inbound_nodes": [[["side_multi3_up", 0, 0, {}]]]}, {"class_name": "Cropping2D", "name": "upside_multi4", "config": {"cropping": [[1, 2], [1, 2]], "name": "upside_multi4", "trainable": true, "data_format": "channels_first"}, "inbound_nodes": [[["side_multi4_up", 0, 0, {}]]]}, {"class_name": "Cropping2D", "name": "upside_multi5", "config": {"cropping": [[0, 1], [0, 1]], "name": "upside_multi5", "trainable": true, "data_format": "channels_first"}, "inbound_nodes": [[["side_multi5_up", 0, 0, {}]]]}, {"class_name": "Cropping2D", "name": "upside_multi6", "config": {"cropping": [[1, 2], [1, 2]], "name": "upside_multi6", "trainable": true, "data_format": "channels_first"}, "inbound_nodes": [[["side_multi6_up", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concat-upscore", "config": {"name": "concat-upscore", "trainable": true, "axis": 1}, "inbound_nodes": [[["Drop1_2_16", 0, 0, {}], ["upside_multi2", 0, 0, {}], ["upside_multi3", 0, 0, {}], ["upside_multi4", 0, 0, {}], ["upside_multi5", 0, 0, {}], ["upside_multi6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "upscore_fuse", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "padding": "valid", "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "name": "upscore_fuse", "filters": 4, "data_format": "channels_first", "kernel_size": [1, 1], "use_bias": true, "trainable": true, "bias_constraint": null}, "inbound_nodes": [[["concat-upscore", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "Dropout_Classifier", "config": {"rate": 0.2, "trainable": true, "name": "Dropout_Classifier", "noise_shape": null, "seed": null}, "inbound_nodes": [[["upscore_fuse", 0, 0, {}]]]}], "output_layers": [["Dropout_Classifier", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.1.4"}