{"config": {"name": "model_1", "output_layers": [["Dropout_Classifier", 0, 0]], "input_layers": [["data_input", 0, 0]], "layers": [{"name": "data_input", "config": {"sparse": false, "name": "data_input", "dtype": "float32", "batch_input_shape": [null, 3, 565, 565]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv1_1", "config": {"name": "conv1_1", "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "trainable": true, "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 64, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["data_input", 0, 0, {}]]]}, {"name": "Drop1_1", "config": {"name": "Drop1_1", "rate": 0.2, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["conv1_1", 0, 0, {}]]]}, {"name": "conv1_2", "config": {"name": "conv1_2", "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "trainable": true, "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 64, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop1_1", 0, 0, {}]]]}, {"name": "Drop1_2", "config": {"name": "Drop1_2", "rate": 0.2, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["conv1_2", 0, 0, {}]]]}, {"name": "max_pool1", "config": {"name": "max_pool1", "pool_size": [2, 2], "strides": [2, 2], "padding": "same", "trainable": true, "data_format": "channels_first"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["Drop1_2", 0, 0, {}]]]}, {"name": "conv2_1", "config": {"name": "conv2_1", "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "trainable": true, "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 128, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pool1", 0, 0, {}]]]}, {"name": "Drop2_1", "config": {"name": "Drop2_1", "rate": 0.2, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["conv2_1", 0, 0, {}]]]}, {"name": "conv2_2", "config": {"name": "conv2_2", "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "trainable": true, "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 128, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop2_1", 0, 0, {}]]]}, {"name": "Drop2_2", "config": {"name": "Drop2_2", "rate": 0.2, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["conv2_2", 0, 0, {}]]]}, {"name": "max_pool2", "config": {"name": "max_pool2", "pool_size": [2, 2], "strides": [2, 2], "padding": "same", "trainable": true, "data_format": "channels_first"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["Drop2_2", 0, 0, {}]]]}, {"name": "conv3_1", "config": {"name": "conv3_1", "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "trainable": true, "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pool2", 0, 0, {}]]]}, {"name": "Drop3_1", "config": {"name": "Drop3_1", "rate": 0.2, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["conv3_1", 0, 0, {}]]]}, {"name": "conv3_2", "config": {"name": "conv3_2", "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "trainable": true, "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop3_1", 0, 0, {}]]]}, {"name": "Drop3_2", "config": {"name": "Drop3_2", "rate": 0.2, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["conv3_2", 0, 0, {}]]]}, {"name": "conv3_3", "config": {"name": "conv3_3", "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "trainable": true, "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop3_2", 0, 0, {}]]]}, {"name": "Drop3_3", "config": {"name": "Drop3_3", "rate": 0.2, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["conv3_3", 0, 0, {}]]]}, {"name": "max_pool3", "config": {"name": "max_pool3", "pool_size": [2, 2], "strides": [2, 2], "padding": "same", "trainable": true, "data_format": "channels_first"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["Drop3_3", 0, 0, {}]]]}, {"name": "conv4_1", "config": {"name": "conv4_1", "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "trainable": true, "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 512, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pool3", 0, 0, {}]]]}, {"name": "Drop4_1", "config": {"name": "Drop4_1", "rate": 0.2, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["conv4_1", 0, 0, {}]]]}, {"name": "conv4_2", "config": {"name": "conv4_2", "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "trainable": true, "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 512, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop4_1", 0, 0, {}]]]}, {"name": "Drop4_2", "config": {"name": "Drop4_2", "rate": 0.2, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["conv4_2", 0, 0, {}]]]}, {"name": "conv4_3", "config": {"name": "conv4_3", "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "trainable": true, "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 512, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop4_2", 0, 0, {}]]]}, {"name": "Drop4_3", "config": {"name": "Drop4_3", "rate": 0.2, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["conv4_3", 0, 0, {}]]]}, {"name": "conv2_2_16", "config": {"name": "conv2_2_16", "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 16, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop2_2", 0, 0, {}]]]}, {"name": "conv3_3_16", "config": {"name": "conv3_3_16", "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 16, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop3_3", 0, 0, {}]]]}, {"name": "conv4_3_16", "config": {"name": "conv4_3_16", "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 16, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop4_3", 0, 0, {}]]]}, {"name": "Drop2_2_16", "config": {"name": "Drop2_2_16", "rate": 0.2, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["conv2_2_16", 0, 0, {}]]]}, {"name": "Drop3_3_16", "config": {"name": "Drop3_3_16", "rate": 0.2, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["conv3_3_16", 0, 0, {}]]]}, {"name": "Drop4_3_16", "config": {"name": "Drop4_3_16", "rate": 0.2, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["conv4_3_16", 0, 0, {}]]]}, {"name": "conv1_2_16", "config": {"name": "conv1_2_16", "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "linear", "trainable": true, "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 16, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["Drop1_2", 0, 0, {}]]]}, {"name": "side_multi2_up", "config": {"name": "side_multi2_up", "size": [2, 2], "data_format": "channels_first", "trainable": true}, "class_name": "UpSampling2D", "inbound_nodes": [[["Drop2_2_16", 0, 0, {}]]]}, {"name": "side_multi3_up", "config": {"name": "side_multi3_up", "size": [4, 4], "data_format": "channels_first", "trainable": true}, "class_name": "UpSampling2D", "inbound_nodes": [[["Drop3_3_16", 0, 0, {}]]]}, {"name": "side_multi4_up", "config": {"name": "side_multi4_up", "size": [8, 8], "data_format": "channels_first", "trainable": true}, "class_name": "UpSampling2D", "inbound_nodes": [[["Drop4_3_16", 0, 0, {}]]]}, {"name": "Drop1_2_16", "config": {"name": "Drop1_2_16", "rate": 0.2, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["conv1_2_16", 0, 0, {}]]]}, {"name": "upside_multi2", "config": {"name": "upside_multi2", "trainable": true, "data_format": "channels_first", "cropping": [[0, 1], [0, 1]]}, "class_name": "Cropping2D", "inbound_nodes": [[["side_multi2_up", 0, 0, {}]]]}, {"name": "upside_multi3", "config": {"name": "upside_multi3", "trainable": true, "data_format": "channels_first", "cropping": [[1, 2], [1, 2]]}, "class_name": "Cropping2D", "inbound_nodes": [[["side_multi3_up", 0, 0, {}]]]}, {"name": "upside_multi4", "config": {"name": "upside_multi4", "trainable": true, "data_format": "channels_first", "cropping": [[1, 2], [1, 2]]}, "class_name": "Cropping2D", "inbound_nodes": [[["side_multi4_up", 0, 0, {}]]]}, {"name": "concat-upscore", "config": {"name": "concat-upscore", "axis": 1, "trainable": true}, "class_name": "Concatenate", "inbound_nodes": [[["Drop1_2_16", 0, 0, {}], ["upside_multi2", 0, 0, {}], ["upside_multi3", 0, 0, {}], ["upside_multi4", 0, 0, {}]]]}, {"name": "upscore_fuse", "config": {"name": "upscore_fuse", "data_format": "channels_first", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1, 1], "activation": "linear", "trainable": true, "padding": "valid", "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 4, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["concat-upscore", 0, 0, {}]]]}, {"name": "Dropout_Classifier", "config": {"name": "Dropout_Classifier", "rate": 0.2, "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["upscore_fuse", 0, 0, {}]]]}]}, "backend": "tensorflow", "keras_version": "2.1.4", "class_name": "Model"}