{"keras_version": "2.1.4", "config": {"output_layers": [["lambda_1", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 3, 584, 565], "dtype": "float32", "name": "data_input"}, "inbound_nodes": [], "name": "data_input"}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "relu", "trainable": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv1_1", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "filters": 64, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["data_input", 0, 0, {}]]], "name": "conv1_1"}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "relu", "trainable": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv1_2", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "filters": 64, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["conv1_1", 0, 0, {}]]], "name": "conv1_2"}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_first", "name": "max_pool1"}, "inbound_nodes": [[["conv1_2", 0, 0, {}]]], "name": "max_pool1"}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "relu", "trainable": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv2_1", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "filters": 128, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["max_pool1", 0, 0, {}]]], "name": "conv2_1"}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "relu", "trainable": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv2_2", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "filters": 128, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_1", 0, 0, {}]]], "name": "conv2_2"}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_first", "name": "max_pool2"}, "inbound_nodes": [[["conv2_2", 0, 0, {}]]], "name": "max_pool2"}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "relu", "trainable": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv3_1", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "filters": 256, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["max_pool2", 0, 0, {}]]], "name": "conv3_1"}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "relu", "trainable": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv3_2", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "filters": 256, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_1", 0, 0, {}]]], "name": "conv3_2"}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "relu", "trainable": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv3_3", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "filters": 256, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_2", 0, 0, {}]]], "name": "conv3_3"}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_first", "name": "max_pool3"}, "inbound_nodes": [[["conv3_3", 0, 0, {}]]], "name": "max_pool3"}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "relu", "trainable": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv4_1", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "filters": 512, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["max_pool3", 0, 0, {}]]], "name": "conv4_1"}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "relu", "trainable": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv4_2", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "filters": 512, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["conv4_1", 0, 0, {}]]], "name": "conv4_2"}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "relu", "trainable": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv4_3", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "filters": 512, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["conv4_2", 0, 0, {}]]], "name": "conv4_3"}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "linear", "trainable": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv2_2_16", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "filters": 16, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_2", 0, 0, {}]]], "name": "conv2_2_16"}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "linear", "trainable": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv3_3_16", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "filters": 16, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_3", 0, 0, {}]]], "name": "conv3_3_16"}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "linear", "trainable": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv4_3_16", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "filters": 16, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["conv4_3", 0, 0, {}]]], "name": "conv4_3_16"}, {"class_name": "Conv2DTranspose", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "linear", "trainable": true, "strides": [2, 2], "kernel_constraint": null, "name": "side_multi2_up", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "filters": 16, "kernel_size": [4, 4], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_2_16", 0, 0, {}]]], "name": "side_multi2_up"}, {"class_name": "Conv2DTranspose", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "linear", "trainable": true, "strides": [4, 4], "kernel_constraint": null, "name": "side_multi3_up", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "valid", "filters": 16, "kernel_size": [8, 8], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_3_16", 0, 0, {}]]], "name": "side_multi3_up"}, {"class_name": "Conv2DTranspose", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "linear", "trainable": true, "strides": [8, 8], "kernel_constraint": null, "name": "side_multi4_up", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "valid", "filters": 16, "kernel_size": [16, 16], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["conv4_3_16", 0, 0, {}]]], "name": "side_multi4_up"}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "linear", "trainable": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv1_2_16", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "filters": 16, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["conv1_2", 0, 0, {}]]], "name": "conv1_2_16"}, {"class_name": "Cropping2D", "config": {"trainable": true, "cropping": [[0, 0], [0, 1]], "data_format": "channels_first", "name": "upside_multi2"}, "inbound_nodes": [[["side_multi2_up", 0, 0, {}]]], "name": "upside_multi2"}, {"class_name": "Cropping2D", "config": {"trainable": true, "cropping": [[2, 2], [3, 4]], "data_format": "channels_first", "name": "upside_multi3"}, "inbound_nodes": [[["side_multi3_up", 0, 0, {}]]], "name": "upside_multi3"}, {"class_name": "Cropping2D", "config": {"trainable": true, "cropping": [[4, 4], [5, 6]], "data_format": "channels_first", "name": "upside_multi4"}, "inbound_nodes": [[["side_multi4_up", 0, 0, {}]]], "name": "upside_multi4"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 1, "name": "concat-upscore"}, "inbound_nodes": [[["conv1_2_16", 0, 0, {}], ["upside_multi2", 0, 0, {}], ["upside_multi3", 0, 0, {}], ["upside_multi4", 0, 0, {}]]], "name": "concat-upscore"}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "linear", "trainable": true, "strides": [1, 1], "kernel_constraint": null, "name": "upscore_fuse", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "filters": 3, "activity_regularizer": null, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["concat-upscore", 0, 0, {}]]], "name": "upscore_fuse"}, {"class_name": "Conv2DTranspose", "config": {"use_bias": true, "kernel_regularizer": null, "activation": "linear", "trainable": true, "strides": [1, 1], "kernel_constraint": null, "name": "conv2d_transpose_1", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "filters": 3, "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["upscore_fuse", 0, 0, {}]]], "name": "conv2d_transpose_1"}, {"class_name": "Permute", "config": {"trainable": true, "dims": [2, 3, 1], "name": "permute_1"}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]], "name": "permute_1"}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_1", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["permute_1", 0, 0, {}]]], "name": "batch_normalization_1"}, {"class_name": "Lambda", "config": {"name": "lambda_1", "function_type": "lambda", "trainable": true, "output_shape_type": "raw", "output_shape": null, "arguments": {}, "function": ["4wEAAAAAAAAABAAAAAUAAABDAAAAczUAAABkAQBkAgCEAAB9AQB8AQB8AACDAQB9AgB8AgB0AABq\nAQB8AgBkAwBkBACDAQEbfQMAfAMAUykFTmMBAAAAAAAAAAEAAAAEAAAAUwAAAHMWAAAAZAEAZAEA\ndAAAagEAfAAAC4MBABcbUykCTukBAAAAKQLaAUvaA2V4cCkB2gF4qQByBQAAAPoWcHl0aG9uL2Ny\nZWF0ZV9tb2RlbC5wedoIPGxhbWJkYT4xAAAAcwAAAAB6H2RlcHRoX3NvZnRtYXguPGxvY2Fscz4u\nPGxhbWJkYT7aBGF4aXPpAAAAACkCcgIAAADaA3N1bSkE2gZtYXRyaXjaB3NpZ21vaWTaEHNpZ21v\naWRlZF9tYXRyaXjaDnNvZnRtYXhfbWF0cml4cgUAAAByBQAAAHIGAAAA2g1kZXB0aF9zb2Z0bWF4\nMAAAAHMIAAAAAAEMAQwBGQE=\n", null, null]}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "lambda_1"}], "input_layers": [["data_input", 0, 0]], "name": "model_1"}, "backend": "tensorflow", "class_name": "Model"}