{"backend": "tensorflow", "keras_version": "2.1.4", "class_name": "Model", "config": {"output_layers": [["upscore_fuse", 0, 0]], "layers": [{"config": {"name": "data_input", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 3, 584, 565]}, "name": "data_input", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "filters": 64, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "conv1_1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv1_1", "class_name": "Conv2D", "inbound_nodes": [[["data_input", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "filters": 64, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "conv1_2", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv1_2", "class_name": "Conv2D", "inbound_nodes": [[["conv1_1", 0, 0, {}]]]}, {"config": {"padding": "same", "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "name": "max_pool1", "trainable": true}, "name": "max_pool1", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv1_2", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "filters": 128, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "conv2_1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv2_1", "class_name": "Conv2D", "inbound_nodes": [[["max_pool1", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "filters": 128, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "conv2_2", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv2_2", "class_name": "Conv2D", "inbound_nodes": [[["conv2_1", 0, 0, {}]]]}, {"config": {"padding": "same", "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "name": "max_pool2", "trainable": true}, "name": "max_pool2", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2_2", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "filters": 256, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "conv3_1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv3_1", "class_name": "Conv2D", "inbound_nodes": [[["max_pool2", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "filters": 256, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "conv3_2", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv3_2", "class_name": "Conv2D", "inbound_nodes": [[["conv3_1", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "filters": 256, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "conv3_3", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv3_3", "class_name": "Conv2D", "inbound_nodes": [[["conv3_2", 0, 0, {}]]]}, {"config": {"padding": "same", "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "name": "max_pool3", "trainable": true}, "name": "max_pool3", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv3_3", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "filters": 512, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "conv4_1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv4_1", "class_name": "Conv2D", "inbound_nodes": [[["max_pool3", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "filters": 512, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "conv4_2", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv4_2", "class_name": "Conv2D", "inbound_nodes": [[["conv4_1", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "filters": 512, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "name": "conv4_3", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv4_3", "class_name": "Conv2D", "inbound_nodes": [[["conv4_2", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "filters": 16, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2_2_16", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv2_2_16", "class_name": "Conv2D", "inbound_nodes": [[["conv2_2", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "filters": 16, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv3_3_16", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv3_3_16", "class_name": "Conv2D", "inbound_nodes": [[["conv3_3", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "filters": 16, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv4_3_16", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv4_3_16", "class_name": "Conv2D", "inbound_nodes": [[["conv4_3", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "strides": [2, 2], "trainable": true, "padding": "same", "filters": 16, "data_format": "channels_first", "kernel_size": [4, 4], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "side_multi2_up", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null}, "name": "side_multi2_up", "class_name": "Conv2DTranspose", "inbound_nodes": [[["conv2_2_16", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "strides": [4, 4], "trainable": true, "padding": "valid", "filters": 16, "data_format": "channels_first", "kernel_size": [8, 8], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "side_multi3_up", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null}, "name": "side_multi3_up", "class_name": "Conv2DTranspose", "inbound_nodes": [[["conv3_3_16", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "strides": [8, 8], "trainable": true, "padding": "valid", "filters": 16, "data_format": "channels_first", "kernel_size": [16, 16], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "side_multi4_up", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null}, "name": "side_multi4_up", "class_name": "Conv2DTranspose", "inbound_nodes": [[["conv4_3_16", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "padding": "same", "filters": 16, "data_format": "channels_first", "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv1_2_16", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "conv1_2_16", "class_name": "Conv2D", "inbound_nodes": [[["conv1_2", 0, 0, {}]]]}, {"config": {"cropping": [[0, 0], [0, 1]], "name": "upside_multi2", "data_format": "channels_first", "trainable": true}, "name": "upside_multi2", "class_name": "Cropping2D", "inbound_nodes": [[["side_multi2_up", 0, 0, {}]]]}, {"config": {"cropping": [[2, 2], [3, 4]], "name": "upside_multi3", "data_format": "channels_first", "trainable": true}, "name": "upside_multi3", "class_name": "Cropping2D", "inbound_nodes": [[["side_multi3_up", 0, 0, {}]]]}, {"config": {"cropping": [[4, 4], [5, 6]], "name": "upside_multi4", "data_format": "channels_first", "trainable": true}, "name": "upside_multi4", "class_name": "Cropping2D", "inbound_nodes": [[["side_multi4_up", 0, 0, {}]]]}, {"config": {"axis": 1, "name": "concat-upscore", "trainable": true}, "name": "concat-upscore", "class_name": "Concatenate", "inbound_nodes": [[["conv1_2_16", 0, 0, {}], ["upside_multi2", 0, 0, {}], ["upside_multi3", 0, 0, {}], ["upside_multi4", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "strides": [1, 1], "trainable": true, "padding": "valid", "filters": 3, "data_format": "channels_first", "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "upscore_fuse", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "name": "upscore_fuse", "class_name": "Conv2D", "inbound_nodes": [[["concat-upscore", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["data_input", 0, 0]]}}