{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "data_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 584, 565], "name": "data_input", "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"name": "conv1_1", "class_name": "Conv2D", "config": {"name": "conv1_1", "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 64, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["data_input", 0, 0, {}]]]}, {"name": "conv1_2", "class_name": "Conv2D", "config": {"name": "conv1_2", "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 64, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv1_1", 0, 0, {}]]]}, {"name": "max_pool1", "class_name": "MaxPooling2D", "config": {"name": "max_pool1", "data_format": "channels_first", "trainable": true, "padding": "same", "strides": [2, 2], "pool_size": [2, 2]}, "inbound_nodes": [[["conv1_2", 0, 0, {}]]]}, {"name": "conv2_1", "class_name": "Conv2D", "config": {"name": "conv2_1", "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 128, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["max_pool1", 0, 0, {}]]]}, {"name": "conv2_2", "class_name": "Conv2D", "config": {"name": "conv2_2", "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 128, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2_1", 0, 0, {}]]]}, {"name": "max_pool2", "class_name": "MaxPooling2D", "config": {"name": "max_pool2", "data_format": "channels_first", "trainable": true, "padding": "same", "strides": [2, 2], "pool_size": [2, 2]}, "inbound_nodes": [[["conv2_2", 0, 0, {}]]]}, {"name": "conv3_1", "class_name": "Conv2D", "config": {"name": "conv3_1", "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 256, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["max_pool2", 0, 0, {}]]]}, {"name": "conv3_2", "class_name": "Conv2D", "config": {"name": "conv3_2", "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 256, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv3_1", 0, 0, {}]]]}, {"name": "conv3_3", "class_name": "Conv2D", "config": {"name": "conv3_3", "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 256, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv3_2", 0, 0, {}]]]}, {"name": "max_pool3", "class_name": "MaxPooling2D", "config": {"name": "max_pool3", "data_format": "channels_first", "trainable": true, "padding": "same", "strides": [2, 2], "pool_size": [2, 2]}, "inbound_nodes": [[["conv3_3", 0, 0, {}]]]}, {"name": "conv4_1", "class_name": "Conv2D", "config": {"name": "conv4_1", "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 512, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["max_pool3", 0, 0, {}]]]}, {"name": "conv4_2", "class_name": "Conv2D", "config": {"name": "conv4_2", "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 512, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv4_1", 0, 0, {}]]]}, {"name": "conv4_3", "class_name": "Conv2D", "config": {"name": "conv4_3", "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 512, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv4_2", 0, 0, {}]]]}, {"name": "conv2_2_16", "class_name": "Conv2D", "config": {"name": "conv2_2_16", "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2_2", 0, 0, {}]]]}, {"name": "conv3_3_16", "class_name": "Conv2D", "config": {"name": "conv3_3_16", "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv3_3", 0, 0, {}]]]}, {"name": "conv4_3_16", "class_name": "Conv2D", "config": {"name": "conv4_3_16", "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv4_3", 0, 0, {}]]]}, {"name": "side_multi2_up", "class_name": "Conv2DTranspose", "config": {"name": "side_multi2_up", "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "filters": 16, "activity_regularizer": null, "strides": [2, 2], "use_bias": true, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [4, 4]}, "inbound_nodes": [[["conv2_2_16", 0, 0, {}]]]}, {"name": "side_multi3_up", "class_name": "Conv2DTranspose", "config": {"name": "side_multi3_up", "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "filters": 16, "activity_regularizer": null, "strides": [4, 4], "use_bias": true, "padding": "valid", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [8, 8]}, "inbound_nodes": [[["conv3_3_16", 0, 0, {}]]]}, {"name": "side_multi4_up", "class_name": "Conv2DTranspose", "config": {"name": "side_multi4_up", "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "filters": 16, "activity_regularizer": null, "strides": [8, 8], "use_bias": true, "padding": "valid", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [16, 16]}, "inbound_nodes": [[["conv4_3_16", 0, 0, {}]]]}, {"name": "conv1_2_16", "class_name": "Conv2D", "config": {"name": "conv1_2_16", "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv1_2", 0, 0, {}]]]}, {"name": "upside_multi2", "class_name": "Cropping2D", "config": {"name": "upside_multi2", "data_format": "channels_first", "trainable": true, "cropping": [[0, 0], [0, 1]]}, "inbound_nodes": [[["side_multi2_up", 0, 0, {}]]]}, {"name": "upside_multi3", "class_name": "Cropping2D", "config": {"name": "upside_multi3", "data_format": "channels_first", "trainable": true, "cropping": [[2, 2], [3, 4]]}, "inbound_nodes": [[["side_multi3_up", 0, 0, {}]]]}, {"name": "upside_multi4", "class_name": "Cropping2D", "config": {"name": "upside_multi4", "data_format": "channels_first", "trainable": true, "cropping": [[4, 4], [5, 6]]}, "inbound_nodes": [[["side_multi4_up", 0, 0, {}]]]}, {"name": "concat-upscore", "class_name": "Concatenate", "config": {"name": "concat-upscore", "axis": 1, "trainable": true}, "inbound_nodes": [[["conv1_2_16", 0, 0, {}], ["upside_multi2", 0, 0, {}], ["upside_multi3", 0, 0, {}], ["upside_multi4", 0, 0, {}]]]}, {"name": "upscore_fuse", "class_name": "Conv2D", "config": {"name": "upscore_fuse", "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 3, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "padding": "valid", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["concat-upscore", 0, 0, {}]]]}, {"name": "conv2d_transpose_1", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_1", "data_format": "channels_first", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "filters": 3, "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["upscore_fuse", 0, 0, {}]]]}, {"name": "permute_1", "class_name": "Permute", "config": {"name": "permute_1", "dims": [2, 3, 1], "trainable": true}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "epsilon": 0.001, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "scale": true, "momentum": 0.99, "gamma_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["permute_1", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "arguments": {}, "output_shape": null, "function_type": "lambda", "trainable": true, "function": ["4wEAAAAAAAAABAAAAAUAAABDAAAAczUAAABkAQBkAgCEAAB9AQB8AQB8AACDAQB9AgB8AgB0AABq\nAQB8AgBkAwBkBACDAQEbfQMAfAMAUykFTmMBAAAAAAAAAAEAAAAEAAAAUwAAAHMWAAAAZAEAZAEA\ndAAAagEAfAAAC4MBABcbUykCTukBAAAAKQLaAUvaA2V4cCkB2gF4qQByBQAAAPoWcHl0aG9uL2Ny\nZWF0ZV9tb2RlbC5wedoIPGxhbWJkYT4xAAAAcwAAAAB6H2RlcHRoX3NvZnRtYXguPGxvY2Fscz4u\nPGxhbWJkYT7aBGF4aXPpAAAAACkCcgIAAADaA3N1bSkE2gZtYXRyaXjaB3NpZ21vaWTaEHNpZ21v\naWRlZF9tYXRyaXjaDnNvZnRtYXhfbWF0cml4cgUAAAByBQAAAHIGAAAA2g1kZXB0aF9zb2Z0bWF4\nMAAAAHMIAAAAAAEMAQwBGQE=\n", null, null], "output_shape_type": "raw"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}], "input_layers": [["data_input", 0, 0]], "output_layers": [["lambda_1", 0, 0]]}, "keras_version": "2.1.4", "backend": "tensorflow"}