{"backend": "tensorflow", "keras_version": "2.1.4", "class_name": "Model", "config": {"input_layers": [["data_input", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "name": "data_input", "class_name": "InputLayer", "config": {"name": "data_input", "dtype": "float32", "batch_input_shape": [null, 3, 584, 565], "sparse": false}}, {"inbound_nodes": [[["data_input", 0, 0, {}]]], "name": "conv1_1", "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv1_1", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "filters": 64, "activation": "relu", "trainable": true, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv1_1", 0, 0, {}]]], "name": "conv1_2", "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv1_2", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "filters": 64, "activation": "relu", "trainable": true, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv1_2", 0, 0, {}]]], "name": "max_pool1", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pool1", "padding": "same", "trainable": true, "data_format": "channels_first", "pool_size": [2, 2]}}, {"inbound_nodes": [[["max_pool1", 0, 0, {}]]], "name": "conv2_1", "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv2_1", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "filters": 128, "activation": "relu", "trainable": true, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2_1", 0, 0, {}]]], "name": "conv2_2", "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv2_2", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "filters": 128, "activation": "relu", "trainable": true, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2_2", 0, 0, {}]]], "name": "max_pool2", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pool2", "padding": "same", "trainable": true, "data_format": "channels_first", "pool_size": [2, 2]}}, {"inbound_nodes": [[["max_pool2", 0, 0, {}]]], "name": "conv3_1", "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv3_1", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "filters": 256, "activation": "relu", "trainable": true, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv3_1", 0, 0, {}]]], "name": "conv3_2", "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv3_2", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "filters": 256, "activation": "relu", "trainable": true, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv3_2", 0, 0, {}]]], "name": "conv3_3", "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv3_3", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "filters": 256, "activation": "relu", "trainable": true, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv3_3", 0, 0, {}]]], "name": "max_pool3", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pool3", "padding": "same", "trainable": true, "data_format": "channels_first", "pool_size": [2, 2]}}, {"inbound_nodes": [[["max_pool3", 0, 0, {}]]], "name": "conv4_1", "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv4_1", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "filters": 512, "activation": "relu", "trainable": true, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv4_1", 0, 0, {}]]], "name": "conv4_2", "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv4_2", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "filters": 512, "activation": "relu", "trainable": true, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv4_2", 0, 0, {}]]], "name": "conv4_3", "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv4_3", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "filters": 512, "activation": "relu", "trainable": true, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2_2", 0, 0, {}]]], "name": "conv2_2_16", "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv2_2_16", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "filters": 16, "activation": "linear", "trainable": true, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv3_3", 0, 0, {}]]], "name": "conv3_3_16", "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv3_3_16", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "filters": 16, "activation": "linear", "trainable": true, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv4_3", 0, 0, {}]]], "name": "conv4_3_16", "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv4_3_16", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "filters": 16, "activation": "linear", "trainable": true, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2_2_16", 0, 0, {}]]], "name": "side_multi2_up", "class_name": "Conv2DTranspose", "config": {"strides": [2, 2], "name": "side_multi2_up", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [4, 4], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "filters": 16, "activation": "linear", "trainable": true, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv3_3_16", 0, 0, {}]]], "name": "side_multi3_up", "class_name": "Conv2DTranspose", "config": {"strides": [4, 4], "name": "side_multi3_up", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [8, 8], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "filters": 16, "activation": "linear", "trainable": true, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv4_3_16", 0, 0, {}]]], "name": "side_multi4_up", "class_name": "Conv2DTranspose", "config": {"strides": [8, 8], "name": "side_multi4_up", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [16, 16], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "filters": 16, "activation": "linear", "trainable": true, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["conv1_2", 0, 0, {}]]], "name": "conv1_2_16", "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv1_2_16", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "filters": 16, "activation": "linear", "trainable": true, "data_format": "channels_first", "bias_regularizer": null}}, {"inbound_nodes": [[["side_multi2_up", 0, 0, {}]]], "name": "upside_multi2", "class_name": "Cropping2D", "config": {"name": "upside_multi2", "trainable": true, "data_format": "channels_first", "cropping": [[0, 0], [0, 1]]}}, {"inbound_nodes": [[["side_multi3_up", 0, 0, {}]]], "name": "upside_multi3", "class_name": "Cropping2D", "config": {"name": "upside_multi3", "trainable": true, "data_format": "channels_first", "cropping": [[2, 2], [3, 4]]}}, {"inbound_nodes": [[["side_multi4_up", 0, 0, {}]]], "name": "upside_multi4", "class_name": "Cropping2D", "config": {"name": "upside_multi4", "trainable": true, "data_format": "channels_first", "cropping": [[4, 4], [5, 6]]}}, {"inbound_nodes": [[["conv1_2_16", 0, 0, {}], ["upside_multi2", 0, 0, {}], ["upside_multi3", 0, 0, {}], ["upside_multi4", 0, 0, {}]]], "name": "concat-upscore", "class_name": "Concatenate", "config": {"name": "concat-upscore", "trainable": true, "axis": 1}}, {"inbound_nodes": [[["concat-upscore", 0, 0, {}]]], "name": "upscore_fuse", "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "upscore_fuse", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "filters": 3, "activation": "sigmoid", "trainable": true, "data_format": "channels_first", "bias_regularizer": null}}], "output_layers": [["upscore_fuse", 0, 0]]}}