{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"sparse": false, "name": "data_input", "dtype": "float32", "batch_input_shape": [null, 3, 584, 565]}, "name": "data_input", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_first", "name": "conv1_1", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "filters": 64, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "relu"}, "name": "conv1_1", "inbound_nodes": [[["data_input", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_first", "name": "conv1_2", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "filters": 64, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "relu"}, "name": "conv1_2", "inbound_nodes": [[["conv1_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_first", "name": "max_pool1", "padding": "same", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "name": "max_pool1", "inbound_nodes": [[["conv1_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_first", "name": "conv2_1", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "filters": 128, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "relu"}, "name": "conv2_1", "inbound_nodes": [[["max_pool1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_first", "name": "conv2_2", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "filters": 128, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "relu"}, "name": "conv2_2", "inbound_nodes": [[["conv2_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_first", "name": "max_pool2", "padding": "same", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "name": "max_pool2", "inbound_nodes": [[["conv2_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_first", "name": "conv3_1", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "filters": 256, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "relu"}, "name": "conv3_1", "inbound_nodes": [[["max_pool2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_first", "name": "conv3_2", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "filters": 256, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "relu"}, "name": "conv3_2", "inbound_nodes": [[["conv3_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_first", "name": "conv3_3", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "filters": 256, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "relu"}, "name": "conv3_3", "inbound_nodes": [[["conv3_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_first", "name": "max_pool3", "padding": "same", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "name": "max_pool3", "inbound_nodes": [[["conv3_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_first", "name": "conv4_1", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "filters": 512, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "relu"}, "name": "conv4_1", "inbound_nodes": [[["max_pool3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_first", "name": "conv4_2", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "filters": 512, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "relu"}, "name": "conv4_2", "inbound_nodes": [[["conv4_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_first", "name": "conv4_3", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "filters": 512, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "relu"}, "name": "conv4_3", "inbound_nodes": [[["conv4_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_first", "name": "conv2_2_16", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "filters": 16, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "linear"}, "name": "conv2_2_16", "inbound_nodes": [[["conv2_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_first", "name": "conv3_3_16", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "filters": 16, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "linear"}, "name": "conv3_3_16", "inbound_nodes": [[["conv3_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_first", "name": "conv4_3_16", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "filters": 16, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "linear"}, "name": "conv4_3_16", "inbound_nodes": [[["conv4_3", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_first", "name": "side_multi2_up", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [4, 4], "trainable": true, "filters": 16, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "linear"}, "name": "side_multi2_up", "inbound_nodes": [[["conv2_2_16", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_first", "name": "side_multi3_up", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "strides": [4, 4], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [8, 8], "trainable": true, "filters": 16, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "linear"}, "name": "side_multi3_up", "inbound_nodes": [[["conv3_3_16", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_first", "name": "side_multi4_up", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "strides": [8, 8], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [16, 16], "trainable": true, "filters": 16, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "linear"}, "name": "side_multi4_up", "inbound_nodes": [[["conv4_3_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_first", "name": "conv1_2_16", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "trainable": true, "filters": 16, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "linear"}, "name": "conv1_2_16", "inbound_nodes": [[["conv1_2", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"trainable": true, "name": "upside_multi2", "cropping": [[0, 0], [0, 1]], "data_format": "channels_first"}, "name": "upside_multi2", "inbound_nodes": [[["side_multi2_up", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"trainable": true, "name": "upside_multi3", "cropping": [[2, 2], [3, 4]], "data_format": "channels_first"}, "name": "upside_multi3", "inbound_nodes": [[["side_multi3_up", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"trainable": true, "name": "upside_multi4", "cropping": [[4, 4], [5, 6]], "data_format": "channels_first"}, "name": "upside_multi4", "inbound_nodes": [[["side_multi4_up", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concat-upscore", "axis": 1}, "name": "concat-upscore", "inbound_nodes": [[["conv1_2_16", 0, 0, {}], ["upside_multi2", 0, 0, {}], ["upside_multi3", 0, 0, {}], ["upside_multi4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "data_format": "channels_first", "name": "upscore_fuse", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "trainable": true, "filters": 3, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "linear"}, "name": "upscore_fuse", "inbound_nodes": [[["concat-upscore", 0, 0, {}]]]}], "output_layers": [["upscore_fuse", 0, 0]], "name": "model_1", "input_layers": [["data_input", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.1.4"}