{"backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["data_input", 0, 0]], "output_layers": [["activation_1", 0, 0]], "layers": [{"name": "data_input", "class_name": "InputLayer", "config": {"name": "data_input", "dtype": "float32", "batch_input_shape": [null, 3, 584, 565], "sparse": false}, "inbound_nodes": []}, {"name": "conv1_1", "class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "name": "conv1_1", "kernel_constraint": null}, "inbound_nodes": [[["data_input", 0, 0, {}]]]}, {"name": "conv1_2", "class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "filters": 64, "activity_regularizer": null, "name": "conv1_2", "kernel_constraint": null}, "inbound_nodes": [[["conv1_1", 0, 0, {}]]]}, {"name": "max_pool1", "class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pool1", "padding": "same", "data_format": "channels_first"}, "inbound_nodes": [[["conv1_2", 0, 0, {}]]]}, {"name": "conv2_1", "class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "filters": 128, "activity_regularizer": null, "name": "conv2_1", "kernel_constraint": null}, "inbound_nodes": [[["max_pool1", 0, 0, {}]]]}, {"name": "conv2_2", "class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "filters": 128, "activity_regularizer": null, "name": "conv2_2", "kernel_constraint": null}, "inbound_nodes": [[["conv2_1", 0, 0, {}]]]}, {"name": "max_pool2", "class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pool2", "padding": "same", "data_format": "channels_first"}, "inbound_nodes": [[["conv2_2", 0, 0, {}]]]}, {"name": "conv3_1", "class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "filters": 256, "activity_regularizer": null, "name": "conv3_1", "kernel_constraint": null}, "inbound_nodes": [[["max_pool2", 0, 0, {}]]]}, {"name": "conv3_2", "class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "filters": 256, "activity_regularizer": null, "name": "conv3_2", "kernel_constraint": null}, "inbound_nodes": [[["conv3_1", 0, 0, {}]]]}, {"name": "conv3_3", "class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "filters": 256, "activity_regularizer": null, "name": "conv3_3", "kernel_constraint": null}, "inbound_nodes": [[["conv3_2", 0, 0, {}]]]}, {"name": "max_pool3", "class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pool3", "padding": "same", "data_format": "channels_first"}, "inbound_nodes": [[["conv3_3", 0, 0, {}]]]}, {"name": "conv4_1", "class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "filters": 512, "activity_regularizer": null, "name": "conv4_1", "kernel_constraint": null}, "inbound_nodes": [[["max_pool3", 0, 0, {}]]]}, {"name": "conv4_2", "class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "filters": 512, "activity_regularizer": null, "name": "conv4_2", "kernel_constraint": null}, "inbound_nodes": [[["conv4_1", 0, 0, {}]]]}, {"name": "conv4_3", "class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "filters": 512, "activity_regularizer": null, "name": "conv4_3", "kernel_constraint": null}, "inbound_nodes": [[["conv4_2", 0, 0, {}]]]}, {"name": "conv2_2_16", "class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "filters": 16, "activity_regularizer": null, "name": "conv2_2_16", "kernel_constraint": null}, "inbound_nodes": [[["conv2_2", 0, 0, {}]]]}, {"name": "conv3_3_16", "class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "filters": 16, "activity_regularizer": null, "name": "conv3_3_16", "kernel_constraint": null}, "inbound_nodes": [[["conv3_3", 0, 0, {}]]]}, {"name": "conv4_3_16", "class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "filters": 16, "activity_regularizer": null, "name": "conv4_3_16", "kernel_constraint": null}, "inbound_nodes": [[["conv4_3", 0, 0, {}]]]}, {"name": "side_multi2_up", "class_name": "Conv2DTranspose", "config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [4, 4], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "padding": "same", "strides": [2, 2], "bias_regularizer": null, "filters": 16, "activity_regularizer": null, "name": "side_multi2_up", "kernel_constraint": null}, "inbound_nodes": [[["conv2_2_16", 0, 0, {}]]]}, {"name": "side_multi3_up", "class_name": "Conv2DTranspose", "config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [8, 8], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "padding": "valid", "strides": [4, 4], "bias_regularizer": null, "filters": 16, "activity_regularizer": null, "name": "side_multi3_up", "kernel_constraint": null}, "inbound_nodes": [[["conv3_3_16", 0, 0, {}]]]}, {"name": "side_multi4_up", "class_name": "Conv2DTranspose", "config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [16, 16], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "padding": "valid", "strides": [8, 8], "bias_regularizer": null, "filters": 16, "activity_regularizer": null, "name": "side_multi4_up", "kernel_constraint": null}, "inbound_nodes": [[["conv4_3_16", 0, 0, {}]]]}, {"name": "conv1_2_16", "class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "strides": [1, 1], "bias_regularizer": null, "filters": 16, "activity_regularizer": null, "name": "conv1_2_16", "kernel_constraint": null}, "inbound_nodes": [[["conv1_2", 0, 0, {}]]]}, {"name": "upside_multi2", "class_name": "Cropping2D", "config": {"name": "upside_multi2", "trainable": true, "data_format": "channels_first", "cropping": [[0, 0], [0, 1]]}, "inbound_nodes": [[["side_multi2_up", 0, 0, {}]]]}, {"name": "upside_multi3", "class_name": "Cropping2D", "config": {"name": "upside_multi3", "trainable": true, "data_format": "channels_first", "cropping": [[2, 2], [3, 4]]}, "inbound_nodes": [[["side_multi3_up", 0, 0, {}]]]}, {"name": "upside_multi4", "class_name": "Cropping2D", "config": {"name": "upside_multi4", "trainable": true, "data_format": "channels_first", "cropping": [[4, 4], [5, 6]]}, "inbound_nodes": [[["side_multi4_up", 0, 0, {}]]]}, {"name": "concat-upscore", "class_name": "Concatenate", "config": {"name": "concat-upscore", "trainable": true, "axis": 1}, "inbound_nodes": [[["conv1_2_16", 0, 0, {}], ["upside_multi2", 0, 0, {}], ["upside_multi3", 0, 0, {}], ["upside_multi4", 0, 0, {}]]]}, {"name": "upscore_fuse", "class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "data_format": "channels_first", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "sigmoid", "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "bias_regularizer": null, "filters": 3, "activity_regularizer": null, "name": "upscore_fuse", "kernel_constraint": null}, "inbound_nodes": [[["concat-upscore", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["upscore_fuse", 0, 0, {}]]]}]}, "class_name": "Model", "keras_version": "2.1.4"}