{"keras_version": "2.1.4", "config": {"output_layers": [["upscore_fuse", 0, 0]], "name": "model_1", "input_layers": [["data_input", 0, 0]], "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 3, 584, 565], "sparse": false, "name": "data_input"}, "name": "data_input", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "name": "conv1_1", "kernel_constraint": null, "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "padding": "same", "bias_constraint": null, "activation": "relu"}, "name": "conv1_1", "class_name": "Conv2D", "inbound_nodes": [[["data_input", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "name": "conv1_2", "kernel_constraint": null, "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "padding": "same", "bias_constraint": null, "activation": "relu"}, "name": "conv1_2", "class_name": "Conv2D", "inbound_nodes": [[["conv1_1", 0, 0, {}]]]}, {"config": {"data_format": "channels_first", "trainable": true, "padding": "same", "pool_size": [2, 2], "name": "max_pool1", "strides": [2, 2]}, "name": "max_pool1", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv1_2", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2_1", "kernel_constraint": null, "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "padding": "same", "bias_constraint": null, "activation": "relu"}, "name": "conv2_1", "class_name": "Conv2D", "inbound_nodes": [[["max_pool1", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2_2", "kernel_constraint": null, "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "padding": "same", "bias_constraint": null, "activation": "relu"}, "name": "conv2_2", "class_name": "Conv2D", "inbound_nodes": [[["conv2_1", 0, 0, {}]]]}, {"config": {"data_format": "channels_first", "trainable": true, "padding": "same", "pool_size": [2, 2], "name": "max_pool2", "strides": [2, 2]}, "name": "max_pool2", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2_2", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "name": "conv3_1", "kernel_constraint": null, "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "padding": "same", "bias_constraint": null, "activation": "relu"}, "name": "conv3_1", "class_name": "Conv2D", "inbound_nodes": [[["max_pool2", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "name": "conv3_2", "kernel_constraint": null, "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "padding": "same", "bias_constraint": null, "activation": "relu"}, "name": "conv3_2", "class_name": "Conv2D", "inbound_nodes": [[["conv3_1", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "name": "conv3_3", "kernel_constraint": null, "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "padding": "same", "bias_constraint": null, "activation": "relu"}, "name": "conv3_3", "class_name": "Conv2D", "inbound_nodes": [[["conv3_2", 0, 0, {}]]]}, {"config": {"data_format": "channels_first", "trainable": true, "padding": "same", "pool_size": [2, 2], "name": "max_pool3", "strides": [2, 2]}, "name": "max_pool3", "class_name": "MaxPooling2D", "inbound_nodes": [[["conv3_3", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 512, "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "name": "conv4_1", "kernel_constraint": null, "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "padding": "same", "bias_constraint": null, "activation": "relu"}, "name": "conv4_1", "class_name": "Conv2D", "inbound_nodes": [[["max_pool3", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 512, "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "name": "conv4_2", "kernel_constraint": null, "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "padding": "same", "bias_constraint": null, "activation": "relu"}, "name": "conv4_2", "class_name": "Conv2D", "inbound_nodes": [[["conv4_1", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 512, "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "name": "conv4_3", "kernel_constraint": null, "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "padding": "same", "bias_constraint": null, "activation": "relu"}, "name": "conv4_3", "class_name": "Conv2D", "inbound_nodes": [[["conv4_2", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 16, "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "name": "conv2_2_16", "kernel_constraint": null, "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "padding": "same", "bias_constraint": null, "activation": "linear"}, "name": "conv2_2_16", "class_name": "Conv2D", "inbound_nodes": [[["conv2_2", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 16, "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "name": "conv3_3_16", "kernel_constraint": null, "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "padding": "same", "bias_constraint": null, "activation": "linear"}, "name": "conv3_3_16", "class_name": "Conv2D", "inbound_nodes": [[["conv3_3", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 16, "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "name": "conv4_3_16", "kernel_constraint": null, "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "padding": "same", "bias_constraint": null, "activation": "linear"}, "name": "conv4_3_16", "class_name": "Conv2D", "inbound_nodes": [[["conv4_3", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [4, 4], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "strides": [2, 2], "kernel_regularizer": null, "name": "side_multi2_up", "kernel_constraint": null, "data_format": "channels_first", "filters": 16, "trainable": true, "padding": "same", "bias_constraint": null, "activation": "linear"}, "name": "side_multi2_up", "class_name": "Conv2DTranspose", "inbound_nodes": [[["conv2_2_16", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [8, 8], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "strides": [4, 4], "kernel_regularizer": null, "name": "side_multi3_up", "kernel_constraint": null, "data_format": "channels_first", "filters": 16, "trainable": true, "padding": "valid", "bias_constraint": null, "activation": "linear"}, "name": "side_multi3_up", "class_name": "Conv2DTranspose", "inbound_nodes": [[["conv3_3_16", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [16, 16], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "strides": [8, 8], "kernel_regularizer": null, "name": "side_multi4_up", "kernel_constraint": null, "data_format": "channels_first", "filters": 16, "trainable": true, "padding": "valid", "bias_constraint": null, "activation": "linear"}, "name": "side_multi4_up", "class_name": "Conv2DTranspose", "inbound_nodes": [[["conv4_3_16", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 16, "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "name": "conv1_2_16", "kernel_constraint": null, "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "trainable": true, "padding": "same", "bias_constraint": null, "activation": "linear"}, "name": "conv1_2_16", "class_name": "Conv2D", "inbound_nodes": [[["conv1_2", 0, 0, {}]]]}, {"config": {"trainable": true, "cropping": [[0, 0], [0, 1]], "data_format": "channels_first", "name": "upside_multi2"}, "name": "upside_multi2", "class_name": "Cropping2D", "inbound_nodes": [[["side_multi2_up", 0, 0, {}]]]}, {"config": {"trainable": true, "cropping": [[2, 2], [3, 4]], "data_format": "channels_first", "name": "upside_multi3"}, "name": "upside_multi3", "class_name": "Cropping2D", "inbound_nodes": [[["side_multi3_up", 0, 0, {}]]]}, {"config": {"trainable": true, "cropping": [[4, 4], [5, 6]], "data_format": "channels_first", "name": "upside_multi4"}, "name": "upside_multi4", "class_name": "Cropping2D", "inbound_nodes": [[["side_multi4_up", 0, 0, {}]]]}, {"config": {"trainable": true, "axis": 1, "name": "concat-upscore"}, "name": "concat-upscore", "class_name": "Concatenate", "inbound_nodes": [[["conv1_2_16", 0, 0, {}], ["upside_multi2", 0, 0, {}], ["upside_multi3", 0, 0, {}], ["upside_multi4", 0, 0, {}]]]}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 3, "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "name": "upscore_fuse", "kernel_constraint": null, "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [1, 1], "trainable": true, "padding": "valid", "bias_constraint": null, "activation": "softmax"}, "name": "upscore_fuse", "class_name": "Conv2D", "inbound_nodes": [[["concat-upscore", 0, 0, {}]]]}]}, "class_name": "Model", "backend": "tensorflow"}