{"backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["data_input", 0, 0]], "layers": [{"name": "data_input", "config": {"name": "data_input", "dtype": "float32", "batch_input_shape": [null, 3, 584, 565], "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv1_1", "config": {"bias_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1_1", "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["data_input", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv1_2", "config": {"bias_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1_2", "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv1_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pool1", "config": {"name": "max_pool1", "trainable": true, "data_format": "channels_first", "pool_size": [2, 2], "strides": [2, 2], "padding": "same"}, "inbound_nodes": [[["conv1_2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv2_1", "config": {"bias_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2_1", "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["max_pool1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2_2", "config": {"bias_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2_2", "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv2_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pool2", "config": {"name": "max_pool2", "trainable": true, "data_format": "channels_first", "pool_size": [2, 2], "strides": [2, 2], "padding": "same"}, "inbound_nodes": [[["conv2_2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv3_1", "config": {"bias_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3_1", "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["max_pool2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv3_2", "config": {"bias_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3_2", "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv3_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv3_3", "config": {"bias_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3_3", "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv3_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "max_pool3", "config": {"name": "max_pool3", "trainable": true, "data_format": "channels_first", "pool_size": [2, 2], "strides": [2, 2], "padding": "same"}, "inbound_nodes": [[["conv3_3", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "conv4_1", "config": {"bias_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv4_1", "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["max_pool3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv4_2", "config": {"bias_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv4_2", "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv4_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv4_3", "config": {"bias_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv4_3", "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv4_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2_2_16", "config": {"bias_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2_2_16", "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv2_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv3_3_16", "config": {"bias_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3_3_16", "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv3_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv4_3_16", "config": {"bias_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv4_3_16", "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv4_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "side_multi2_up", "config": {"bias_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_size": [4, 4], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "side_multi2_up", "use_bias": true, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "strides": [2, 2], "padding": "same"}, "inbound_nodes": [[["conv2_2_16", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "side_multi3_up", "config": {"bias_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_size": [8, 8], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "side_multi3_up", "use_bias": true, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "strides": [4, 4], "padding": "valid"}, "inbound_nodes": [[["conv3_3_16", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "side_multi4_up", "config": {"bias_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_size": [16, 16], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "side_multi4_up", "use_bias": true, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "strides": [8, 8], "padding": "valid"}, "inbound_nodes": [[["conv4_3_16", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "conv1_2_16", "config": {"bias_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1_2_16", "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv1_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "upside_multi2", "config": {"name": "upside_multi2", "trainable": true, "data_format": "channels_first", "cropping": [[0, 0], [0, 1]]}, "inbound_nodes": [[["side_multi2_up", 0, 0, {}]]], "class_name": "Cropping2D"}, {"name": "upside_multi3", "config": {"name": "upside_multi3", "trainable": true, "data_format": "channels_first", "cropping": [[2, 2], [3, 4]]}, "inbound_nodes": [[["side_multi3_up", 0, 0, {}]]], "class_name": "Cropping2D"}, {"name": "upside_multi4", "config": {"name": "upside_multi4", "trainable": true, "data_format": "channels_first", "cropping": [[4, 4], [5, 6]]}, "inbound_nodes": [[["side_multi4_up", 0, 0, {}]]], "class_name": "Cropping2D"}, {"name": "concat-upscore", "config": {"name": "concat-upscore", "trainable": true, "axis": 1}, "inbound_nodes": [[["conv1_2_16", 0, 0, {}], ["upside_multi2", 0, 0, {}], ["upside_multi3", 0, 0, {}], ["upside_multi4", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "upscore_fuse", "config": {"bias_constraint": null, "trainable": true, "data_format": "channels_first", "kernel_size": [1, 1], "kernel_regularizer": null, "filters": 3, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "upscore_fuse", "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "padding": "valid"}, "inbound_nodes": [[["concat-upscore", 0, 0, {}]]], "class_name": "Conv2D"}], "output_layers": [["upscore_fuse", 0, 0]]}, "keras_version": "2.1.4", "class_name": "Model"}